Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad
The AnalysisDecomposedTemperatureLoad class contains information related to decomposed temperature loads.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad._AxialTemperatureDifference
The axial temperature difference of the analysis decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad._VerticalTemperatureDifference
The vertical temperature difference of the analysis decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad._HorizontalTemperatureDifference
The horizontal temperature difference of the analysis decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad._Strain
The strain of the analysis decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.AxialTemperatureDifference
The axial temperature difference of the decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.VerticalTemperatureDifference
The vertical temperature difference of the decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.HorizontalTemperatureDifference
The horizontal temperature difference of the decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.Strain
The strain of the decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.Select
Selects an analysis decomposed temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad.SelectInstance
DO NOT USE! For internal usage only!